Repository: zibuyu2015831/LangoTrace
Catalog: Packages/LangoTraceUI/Sources/LangoTraceUI/Resources/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, ru, zh_hans

# entry.rendering.generateLearningMaterial.generatingSummary
source: The configured AI Provider is processing this entry.
zh_hans: 已配置的 AI Provider 正在处理这条记录。

# entry.rendering.generateLearningMaterial.generatingTitle
source: Generating Learning Material
zh_hans: 正在生成学习材料

# entry.rendering.generateLearningMaterial.summary
source: Send this text to your configured AI Provider to create target-language material.
zh_hans: 将当前文本发送给已配置的 AI Provider，生成目标语言学习材料。

# entry.rendering.generateLearningMaterial.title
source: Generate Learning Material
zh_hans: 生成学习材料

# entry.rendering.generateLearningMaterial.tooLongSummary
source: This content is long. Select a shorter passage before generating learning material.
zh_hans: 内容较长，先选择一段生成学习材料。

# entry.rendering.learningText.accessibilityLabel
source: Editable learning text
zh_hans: 可编辑学习文本

# entry.rendering.learningText.analysisFailed
source: Reanalysis failed. Check AI Provider settings, then try again.
zh_hans: 重新分析失败。检查 AI Provider 设置后可以重试。

# entry.rendering.learningText.analyzing
source: Reanalyzing the current learning text.
zh_hans: 正在重新分析当前学习文本。

# entry.rendering.learningText.reanalyze
source: Reanalyze
zh_hans: 重新分析

# entry.rendering.learningText.save
source: Save Changes
zh_hans: 保存修改

# entry.rendering.learningText.stale
source: Text changed. Reanalyze to refresh sentence notes and practice candidates.
zh_hans: 文本已修改。重新分析后会刷新单句讲解和练习候选。

# entry.rendering.localPreview.summary
source: Create a target-language draft on this device. Nothing leaves your device.
zh_hans: 在本机生成目标语言草稿，内容不会离开设备。

# entry.rendering.localPreview.title
source: Generate Local Preview
zh_hans: 生成本地预览

# entry.rendering.pending
source: Waiting for generation
zh_hans: 等待生成

# entry.targetLanguage.title
source: Target Language
zh_hans: 目标语言

# entryCard.openDetail.label
source: Open detail for %@
zh_hans: 打开 %@ 的详情

# entryDetail.header.boundary
source: The life entry and target-language version stay linked. Review the material on this device before using any online capability.
zh_hans: 生活记录和目标语言版本保持来源关系。使用在线能力前，可先在本机检查学习材料。

# entryDetail.practiceEntry.subtitle
source: Practice stays on this device and does not record voice.
zh_hans: 练习保留在本机，不会录音。

# entryDetail.practiceEntry.title
source: Practice Entry
zh_hans: 进入练习

# entryDetail.sentences.subtitle
source: Move from a real-life entry into listening, reading, shadowing, and back translation.
zh_hans: 从真实记录进入听、读、跟读和回译。

# entryDetail.sentences.title
source: Sentence Practice
zh_hans: 逐句练习

# entryEditor.privacy.localOnly
source: Saved on this device. Nothing is sent to external AI.
zh_hans: 保存在本机，不会发送到外部 AI。

# entrySource.photoWriting
source: Photo Writing
zh_hans: 照片写作

# entrySource.targetLanguageWriting
source: Target-language Writing
zh_hans: 目标语写作

# entrySource.typedText
source: Typed Text
zh_hans: 文本输入

# filter.settled
source: Settled
zh_hans: 已沉淀

# hero.secondaryUnavailable
source: Photo and voice tools are planned
zh_hans: 照片和语音工具规划中

# hero.title
source: Record a little life today
zh_hans: 今天记录一点生活

# ipad.emptyWorkspace.body
source: After you create the first life entry, the workspace will show the native-language note, target-language draft, and sentence practice.
zh_hans: 创建第一条生活记录后，中间工作台会显示母语记录、目标语言草稿和逐句练习。

# ipad.learningPanel.hide
source: Hide Learning Panel
zh_hans: 隐藏学习面板

# ipad.learningPanel.show
source: Show Learning Panel
zh_hans: 显示学习面板

# ipad.timeline.hide
source: Hide Timeline
zh_hans: 隐藏时间线

# ipad.timeline.show
source: Show Timeline
zh_hans: 显示时间线

# languageSpace.current.accessibilityLabel
source: Current language space, %@
zh_hans: 当前语言空间，%@

# languageSpace.switcher.add
source: Add Learning Language
zh_hans: 添加学习语言

# languageSpace.switcher.allSection
source: All Language Spaces
zh_hans: 所有语言空间

# languageSpace.switcher.currentBadge
source: Current
zh_hans: 当前

# languageSpace.switcher.headerSummary
source: Switch the learning context for records, practice, and memory.
zh_hans: 切换记录、练习和记忆使用的学习上下文。

# languageSpace.switcher.hint
source: Opens language space details.
zh_hans: 打开语言空间详情。

# languageSpace.switcher.label
source: Language space switcher
zh_hans: 语言空间切换

# languageSpace.switcher.localFirstFootnote
source: Your data stays on this device by default. Switching spaces does not change the app interface language.
zh_hans: 数据默认保存在本机。切换语言空间不会改变 App 界面语言。

# languageSpace.switcher.manage
source: Manage Language Spaces
zh_hans: 管理语言空间

# languageSpace.switcher.title
source: Language Spaces
zh_hans: 语言空间

# learnerProfile.blindSpots.empty
source: Do a few dictation exercises to unlock your error patterns.
zh_hans: 做几次听写练习以解锁错误模式分析。

# learnerProfile.blindSpots.footer
source: From your dictation practice — repeated transcription errors, not a grammar verdict.
zh_hans: 来自你的听写练习——重复的转写错误，不是语法判决。

# learnerProfile.blindSpots.kind.changed
source: mistyped
zh_hans: 写错

# learnerProfile.blindSpots.kind.extra
source: extra
zh_hans: 多写

# learnerProfile.blindSpots.kind.missing
source: missed
zh_hans: 漏写

# learnerProfile.blindSpots.placeholder
source: As you practice and produce, common blind spots will appear here (coming soon).
zh_hans: 随着你练习与产出，这里会显示常见盲点（即将推出）。

# learnerProfile.blindSpots.title
source: Repeated Practice Errors
zh_hans: 重复练习错误模式

# learnerProfile.cancel
source: Cancel
zh_hans: 取消

# learnerProfile.coverage.count
source: %lld items covered
zh_hans: 已覆盖 %lld 项

# learnerProfile.coverage.title
source: Knowledge Coverage
zh_hans: 知识覆盖

# learnerProfile.kind.goal
source: Goal
zh_hans: 目标

# learnerProfile.kind.lifeFact
source: Life fact
zh_hans: 生活事实

# learnerProfile.kind.preference
source: Preference
zh_hans: 偏好

# learnerProfile.kind.relationship
source: Relationship
zh_hans: 关系

# learnerProfile.level.calibrating
source: About %@, continuously calibrating
zh_hans: 约 %@，持续校准

# learnerProfile.level.title
source: Current Level
zh_hans: 当前水平

# learnerProfile.memory.empty
source: Keep recording to unlock your profile.
zh_hans: 继续记录以解锁画像。

# learnerProfile.memory.kind
source: Kind
zh_hans: 类别

# learnerProfile.memory.save
source: Remember
zh_hans: 记住

# learnerProfile.memory.subtitle
source: Life facts and goals you explicitly asked the App to remember.
zh_hans: 你显式让 App 记住的生活事实与目标。

# learnerProfile.memory.textPlaceholder
source: e.g. I work in Shanghai
zh_hans: 例如：我在上海工作

# learnerProfile.memory.title
source: What the App Remembers About You
zh_hans: App 记住的关于你

# learnerProfile.reset.button
source: Reset What the App Knows About Me
zh_hans: 重置 App 对我的了解

# learnerProfile.reset.confirm.action
source: Reset
zh_hans: 重置

# learnerProfile.reset.confirm.message
source: This only clears the life facts the App remembers about you. Your learning records and memory library are not affected.
zh_hans: 这只会清除 App 记住的关于你的生活事实，不影响你的学习记录与记忆库。

# learnerProfile.reset.confirm.title
source: Reset what the App knows about you?
zh_hans: 重置 App 对你的了解？

# learnerProfile.review.due
source: %lld due for review
zh_hans: 待复习 %lld

# learnerProfile.review.mastered
source: %lld mastered
zh_hans: 已掌握 %lld

# learnerProfile.review.thisWeek
source: %lld added this week
zh_hans: 本周新增 %lld

# learnerProfile.review.title
source: Memory Review
zh_hans: 记忆复习

# learnerProfile.title
source: Learning Profile
zh_hans: 学习画像

# learnerProfile.unavailable
source: Profile temporarily unavailable.
zh_hans: 暂时无法加载画像。

# mac.bulkImport.summary
source: Markdown, image, and audio import require local data storage and attachment handling first.
zh_hans: 拖入 Markdown、图片或音频前，需要先完成本地数据层和附件存储。

# mac.bulkImport.title
source: Bulk Import
zh_hans: 批量导入

# mac.entries.library.subtitle
source: Your saved life entries and learning material.
zh_hans: 你的生活记录和学习材料。

# mac.entries.library.title
source: Entry Library
zh_hans: 记录库

# mac.entryMissing.body
source: Choose another life entry from the library.
zh_hans: 请选择记录库中的其他生活记录。

# mac.entryMissing.title
source: Entry Not Found
zh_hans: 记录不存在

# mac.inspector.entries.body
source: After you choose an entry, Inspector shows request preview and privacy boundaries.
zh_hans: 选择一条记录后，Inspector 会显示请求预览和隐私边界。

# mac.inspector.entries.title
source: Entry Library
zh_hans: 记录库

# mac.inspector.entryMetadata.title
source: Entry Metadata
zh_hans: 记录元数据

# mac.inspector.hide
source: Hide Inspector
zh_hans: 隐藏检查器

# mac.inspector.importExport.body
source: Import and export will be designed around your local library and attachment folders.
zh_hans: 导入导出将围绕本地资料库和附件目录设计。

# mac.inspector.importExport.title
source: Import and Export
zh_hans: 导入导出

# mac.inspector.memory.body
source: Phrase memory is collected from your life entries and can support later review.
zh_hans: 词句记忆来自生活记录，可用于之后复习。

# mac.inspector.memory.title
source: Memory
zh_hans: 记忆

# mac.inspector.memoryCandidates
source: Memory Candidates
zh_hans: 词句候选

# mac.inspector.nextCapability.body
source: Speech playback, recording, scoring, and dictation results require Speech and TTS modules.
zh_hans: 语音播放、录音、评分和听写结果需要 Speech / TTS 模块接入。

# mac.inspector.nextCapability.title
source: Next Capability
zh_hans: 后续能力

# mac.inspector.noEntry.body
source: Choose an entry from the library.
zh_hans: 请选择记录库中的记录。

# mac.inspector.noEntry.title
source: No Entry
zh_hans: 没有记录

# mac.inspector.noMemory.body
source: This entry has no extracted phrases yet. The current build does not call AI or write to the vector index.
zh_hans: 这条记录还没有提取词句。当前不会调用 AI，也不会写入向量索引。

# mac.inspector.noMemory.title
source: No phrases yet
zh_hans: 暂无词句

# mac.inspector.practice.body
source: Practice sessions use your selected life entry as the source material.
zh_hans: 练习会话以当前选中的生活记录为材料。

# mac.inspector.practice.title
source: Practice
zh_hans: 练习

# mac.inspector.practiceStatus.body
source: Practice moves through listening, shadowing, recall, and comparison steps on this device.
zh_hans: 练习会在本机完成听、跟读、回忆和对照步骤。

# mac.inspector.practiceStatus.title
source: Practice Status
zh_hans: 练习状态

# mac.inspector.privacy.body
source: This detail view reads the current life entry and learning material on this device. It does not send content anywhere by itself.
zh_hans: 当前详情页只读取本机生活记录和学习材料，不会自行发送内容。

# mac.inspector.privacy.title
source: Privacy Boundary
zh_hans: 隐私边界

# mac.inspector.settings.body
source: Settings explains capability boundaries without changing provider, sync, or export preferences.
zh_hans: 设置页展示能力边界，不会改变 Provider、同步或导出偏好。

# mac.inspector.settings.title
source: Settings
zh_hans: 设置

# mac.inspector.show
source: Show Inspector
zh_hans: 显示检查器

# mac.inspector.title
source: Learning Panel
zh_hans: 学习面板

# mac.inspector.today.body
source: Today focuses on the selected life entry and its learning material.
zh_hans: 今日工作台聚焦当前生活记录和学习材料。

# mac.inspector.today.title
source: Local First
zh_hans: 本地优先

# mac.inspector.unavailable.body
source: Choose an available action or configure the required capability first.
zh_hans: 请选择可用操作，或先完成对应能力配置。

# mac.memory.section.subtitle
source: Collected from life-entry context for later review.
zh_hans: 来自生活记录上下文，便于之后复习。

# mac.memory.section.title
source: Phrase Memory
zh_hans: 词句记忆

# mac.practice.noRendering.summary
source: Create learning material for this entry before starting practice.
zh_hans: 先为这条记录生成学习材料，再开始练习。

# mac.practice.section.subtitle
source: Move from life entries into reading, shadowing, dictation, and back translation.
zh_hans: 从生活记录进入听读、跟读、听写和回译。

# mac.practice.section.title
source: Practice
zh_hans: 练习

# mac.practiceUnavailable.body
source: Choose an existing entry before entering practice.
zh_hans: 请选择一条已有记录后再进入练习。

# mac.practiceUnavailable.title
source: Practice Needs Material
zh_hans: 练习需要材料

# mac.searchFilter.summary
source: Search will cover your life entries, phrases, and review material.
zh_hans: 搜索将覆盖生活记录、词句和复习材料。

# mac.searchFilter.title
source: Search and Filter
zh_hans: 搜索与筛选

# mac.section.entries
source: Entries
zh_hans: 记录库

# mac.section.entries.description
source: Browse life entries and inspect their learning material.
zh_hans: 浏览生活记录并查看对应学习材料。

# mac.section.entries.subtitle
source: %d entries
zh_hans: %d 条记录

# mac.section.importExport
source: Import / Export
zh_hans: 导入导出

# mac.section.importExport.description
source: Prepare local library import and export workflows.
zh_hans: 准备本地资料库导入导出流程。

# mac.section.importExport.subtitle
source: Planned workflow
zh_hans: 规划中

# mac.section.memory
source: Memory
zh_hans: 记忆

# mac.section.memory.description
source: Review personal phrases extracted from life-entry context.
zh_hans: 查看从生活记录上下文提取的个人词句。

# mac.section.memory.subtitle
source: %d memory items
zh_hans: %d 个记忆项

# mac.section.practice.description
source: Use life entries for shadowing, dictation, and back-translation practice.
zh_hans: 用生活记录进行跟读、听写和回译练习。

# mac.section.practice.subtitle
source: Practice sessions
zh_hans: 练习会话

# mac.section.settings.description
source: Read AI, sync, local data, and privacy boundaries.
zh_hans: 查看 AI、同步、本地数据和隐私边界。

# mac.section.settings.subtitle
source: Preferences
zh_hans: 偏好

# mac.section.today.description
source: Capture one life moment and review its learning material.
zh_hans: 记录一个生活片段，并查看对应学习材料。

# mac.section.today.subtitle
source: %d today
zh_hans: 今天 %d 条

# mac.settingMissing.body
source: Choose a setting item from the sidebar.
zh_hans: 请选择侧边栏中的设置项。

# mac.settingMissing.title
source: Setting Not Found
zh_hans: 设置项不存在

# mac.settings.section.subtitle
source: Review local-first, language, provider, sync, and export preferences.
zh_hans: 查看本地优先、语言、Provider、同步和导出偏好。

# mac.settings.section.title
source: Settings
zh_hans: 设置

# mac.sidebar.hide
source: Hide Sidebar
zh_hans: 隐藏侧边栏

# mac.sidebar.show
source: Show Sidebar
zh_hans: 显示侧边栏

# mac.today.empty.body
source: After the first life entry is created, request preview and learning material appear here.
zh_hans: 创建第一条生活记录后，这里会显示请求预览和学习材料。

# mac.today.empty.title
source: No Entries Yet
zh_hans: 还没有记录

# memory.deposit.action
source: Add to memory
zh_hans: 加入记忆

# memory.deposit.added
source: Added
zh_hans: 已加入

# memory.deposited.empty.body
source: Add words or sentences from the candidates below.
zh_hans: 从下方的候选词句中加入。

# memory.deposited.empty.title
source: No saved memory yet
zh_hans: 还没有沉淀的记忆

# memory.empty.body
source: Create learning material from a life entry, and useful expressions will appear here.
zh_hans: 从生活记录生成学习材料后，有用表达会出现在这里。

# memory.empty.title
source: No saved phrases yet
zh_hans: 还没有词句

# memory.layer.content.summary
source: %d life entries have local memory extracts.
zh_hans: %d 条生活记录带有本地记忆提取。

# memory.layer.content.title
source: Content Memory
zh_hans: 内容记忆

# memory.layer.language.summary
source: %d phrases are shown as local preview items.
zh_hans: %d 个词句以本地预览形式显示。

# memory.layer.language.title
source: Language Memory
zh_hans: 语言记忆

# memory.layer.study.summary
source: Review scheduling will use your saved phrase memory.
zh_hans: 复习排程将基于已保存的词句记忆。

# memory.layer.study.title
source: Study Memory
zh_hans: 学习记忆

# memory.review.done
source: Done
zh_hans: 完成

# memory.review.empty.body
source: New deposits will show up here when they're due.
zh_hans: 新沉淀的词句到期后会出现在这里。

# memory.review.empty.title
source: Nothing to review right now
zh_hans: 暂时没有要复习的

# memory.review.finished.body
source: You've reviewed everything due for now.
zh_hans: 你已经看完当前到期的内容。

# memory.review.finished.title
source: Nice session
zh_hans: 这轮不错

# memory.review.markMastered
source: Mark as mastered
zh_hans: 标记已掌握

# memory.review.needsAnotherLook
source: Look again
zh_hans: 还要再看

# memory.review.remembered
source: I remember
zh_hans: 记得

# memory.review.reveal
source: Show meaning
zh_hans: 看释义

# memory.review.start
source: Start review
zh_hans: 开始复习

# memory.review.title
source: Review
zh_hans: 复习

# memory.stats.deposited
source: This week
zh_hans: 本周沉淀

# memory.stats.due
source: To review
zh_hans: 待复习

# memory.stats.mastered
source: Mastered
zh_hans: 已掌握

# memory.vectorIndex.body
source: The local memory index will be rebuilt from your life entries when search is enabled.
zh_hans: 开启搜索后，本地记忆索引会从生活记录重新构建。

# memory.vectorIndex.title
source: Vector Index
zh_hans: 向量索引

# onboarding.createSpace.accessibilityHint
source: Create a %@ learning space and enter the main app
zh_hans: 创建 %@ 学习空间并进入主体页面

# onboarding.level.accessibilityHint
source: Choose the current %@ level
zh_hans: 选择当前 %@ 水平

# pad.currentSentence.pending
source: Sentence notes appear after generation.
zh_hans: 等待生成后显示句子讲解。

# pad.currentSentence.title
source: Current Sentence Notes
zh_hans: 当前句讲解

# pad.filter.all
source: All
zh_hans: 全部

# pad.filter.needsPractice
source: Needs Practice
zh_hans: 待练习

# pad.learningPanel.empty.body
source: After the first life entry is created, this panel shows request previews, phrase extraction, and practice entry points.
zh_hans: 创建第一条生活记录后，这里会展示请求预览、词句提取和练习入口。

# pad.learningPanel.empty.title
source: No Entry
zh_hans: 没有记录

# pad.learningPanel.importExport.panel.body
source: This page does not read files, export archives, or modify saved entries.
zh_hans: 本页不会读取文件、导出归档或修改已保存记录。

# pad.learningPanel.importExport.panel.title
source: No Background Transfer
zh_hans: 不会后台迁移

# pad.learningPanel.importExport.subtitle
source: Data movement stays explicit.
zh_hans: 数据迁移保持显式。

# pad.learningPanel.importExport.title
source: Import and Export
zh_hans: 导入导出

# pad.learningPanel.languageSpace.panel.body
source: A language space defines the target language for entries, practice, and memory.
zh_hans: 语言空间定义记录、练习和记忆使用的目标语言。

# pad.learningPanel.languageSpace.panel.title
source: Space Boundary
zh_hans: 空间边界

# pad.learningPanel.languageSpace.subtitle
source: Current learning direction and level.
zh_hans: 当前学习方向和水平。

# pad.learningPanel.languageSpace.title
source: Language Space
zh_hans: 语言空间

# pad.learningPanel.memory.panel.body
source: Phrases and patterns stay tied to the entries that created them.
zh_hans: 词句和表达模式会保留与来源记录的关系。

# pad.learningPanel.memory.panel.title
source: Life-based Memory
zh_hans: 生活记忆

# pad.learningPanel.memory.subtitle
source: Review what life entries have produced.
zh_hans: 查看生活记录沉淀的内容。

# pad.learningPanel.memory.title
source: Memory Context
zh_hans: 记忆上下文

# pad.learningPanel.settings.aiProvider.summary
source: Configure models and secure provider access.
zh_hans: 配置模型和安全访问信息。

# pad.learningPanel.settings.privacy.body
source: Opening settings does not send entries, photos, audio, or provider secrets.
zh_hans: 打开设置不会发送记录、照片、音频或 Provider 密钥。

# pad.learningPanel.settings.privacy.title
source: Privacy Boundary
zh_hans: 隐私边界

# pad.learningPanel.settings.subtitle
source: Focused on configuration for this language space.
zh_hans: 围绕当前语言空间的配置。

# pad.learningPanel.settings.sync.summary
source: Review sync status and boundaries.
zh_hans: 查看同步状态和边界。

# pad.learningPanel.settings.title
source: Settings Context
zh_hans: 设置上下文

# pad.learningPanel.subtitle
source: Generated around the current entry.
zh_hans: 围绕当前记录生成。

# pad.learningPanel.title
source: Learning Panel
zh_hans: 学习面板

# pad.memory.empty.summary
source: This entry has no extracted phrases yet. No AI call or vector index write occurs.
zh_hans: 这条记录还没有提取词句。当前不会调用 AI，也不会写入向量索引。

# pad.memory.section.subtitle
source: Phrases, similar snippets, and long-term traces.
zh_hans: 词句、相似片段和长期轨迹。

# pad.memory.section.title
source: Memory
zh_hans: 记忆

# pad.memoryExtraction.title
source: Phrase Extraction
zh_hans: 词句提取

# pad.practice.empty.summary
source: This entry needs practice material before training can start.
zh_hans: 这条记录需要先生成练习材料。

# pad.practiceEntry.title
source: Start Practice
zh_hans: 进入练习

# pad.search.hint
source: Opens search capability details.
zh_hans: 打开搜索能力说明。

# pad.search.placeholder
source: Search entries, phrases, and similar life moments
zh_hans: 搜索记录、词句、相似生活片段

# pad.sentences.subtitle
source: Move from a real-life entry into listening, reading, shadowing, and back translation.
zh_hans: 从真实记录进入听、读、跟读和回译。

# pad.sentences.title
source: Sentence Practice
zh_hans: 逐句练习

# pad.settings.section.subtitle
source: Review local-first, language, provider, sync, and export preferences.
zh_hans: 查看本地优先、语言、Provider、同步和导出偏好。

# pad.settings.section.title
source: Settings
zh_hans: 设置

# pad.sidebar.filters
source: Filters
zh_hans: 筛选

# pad.sidebar.pages
source: Pages
zh_hans: 页面

# pad.sidebar.timeline
source: Timeline
zh_hans: 时间线

# pad.spaceSettings.summary
source: Review AI, sync, local data, and privacy preferences.
zh_hans: 查看 AI、同步、本地数据和隐私偏好。

# pad.spaceSettings.title
source: Space Settings
zh_hans: 空间设置

# phone.entries.continue.subtitle
source: Review source, target-language text, request preview, and practice entry.
zh_hans: 查看原文、目标语文本、请求预览和练习入口。

# phone.entries.continue.title
source: Continue From Entries
zh_hans: 从记录继续

# phone.entries.status
source: Life entries are stored on this device.
zh_hans: 生活记录保存在本机。

# phone.memory.deposited.subtitle
source: Words and sentences you've kept
zh_hans: 你保留下来的词句

# phone.memory.deposited.title
source: Saved memory
zh_hans: 已沉淀记忆

# phone.memory.personal.subtitle
source: Collected from life-entry context for later review.
zh_hans: 来自生活记录上下文，便于之后复习。

# phone.memory.personal.title
source: Personal Phrases
zh_hans: 个人词句

# phone.memory.status
source: Phrase memory comes from your life entries.
zh_hans: 词句记忆来自你的生活记录。

# phone.practice.empty.body
source: Create or select an entry with learning material first.
zh_hans: 请先创建或选择带有学习材料的记录。

# phone.practice.empty.title
source: No Practice Content
zh_hans: 没有练习内容

# phone.practice.fromLife.subtitle
source: Practice listening, shadowing, recall, and comparison from life entries.
zh_hans: 从生活记录开始听、跟读、回忆和对照练习。

# phone.practice.fromLife.title
source: Practice From Life
zh_hans: 从生活进入练习

# phone.practice.status
source: Practice %@ from life entries.
zh_hans: 从生活记录练习 %@。

# phone.settings.currentSpace.subtitle
source: Review AI, sync, local data, and privacy preferences.
zh_hans: 查看 AI、同步、本地数据和隐私偏好。

# phone.settings.currentSpace.title
source: Current Space
zh_hans: 当前空间

# phone.settings.status
source: Capability boundaries and preferences.
zh_hans: 能力边界和偏好设置。

# phone.today.recent.subtitle
source: Choose one entry to inspect its learning material.
zh_hans: 选择一条记录查看学习材料。

# phone.today.recent.title
source: Recent Life Entries
zh_hans: 最近的生活记录

# phone.today.status
source: Today starts from one life entry.
zh_hans: 今天从一条生活记录开始。

# photoWriting.assist.adopt
source: Use this draft
zh_hans: 采用这段草稿

# photoWriting.assist.button
source: Ask AI about this photo
zh_hans: 让 AI 看图帮我写

# photoWriting.assist.confirm.message
source: Your photo and your note will be sent to your AI provider to generate writing help. Nothing else is sent.
zh_hans: 你的照片和这段备注将发送给 AI Provider 以生成写作帮助，不会发送其它内容。

# photoWriting.assist.confirm.send
source: Send
zh_hans: 发送

# photoWriting.assist.confirm.title
source: Send this photo to your AI provider?
zh_hans: 把这张照片发送给 AI Provider？

# photoWriting.assist.dismiss
source: Dismiss
zh_hans: 关闭

# photoWriting.assist.error.generic
source: Couldn't get writing help. Check your AI provider and try again.
zh_hans: 未能获取写作帮助，请检查 AI Provider 后重试。

# photoWriting.assist.guidance.imageInputDisabled
source: Turn on image input for this AI provider in Settings to use photo writing help.
zh_hans: 请先在设置中为该 AI Provider 开启图片输入，才能使用照片写作帮助。

# photoWriting.assist.mode.draft
source: Native draft
zh_hans: 母语草稿

# photoWriting.assist.mode.suggestions
source: Writing tips
zh_hans: 写作提示

# photoWriting.assist.result.angles
source: Writing angles
zh_hans: 写作角度

# photoWriting.assist.result.draft
source: Draft to translate
zh_hans: 待翻译草稿

# photoWriting.assist.result.expressions
source: Useful expressions
zh_hans: 可用表达

# photoWriting.assist.result.questions
source: Guiding questions
zh_hans: 引导问题

# photoWriting.assist.result.scene
source: What's in the photo
zh_hans: 照片内容
